# Series

In [70]:
import pandas as pd

In [71]:
data = [1, 2, 3, 4, 5]

In [72]:
s = pd.Series(data)

In [73]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [74]:
index = ['Linha' + str(i) for i in range(5)]

In [75]:
s = pd.Series(data = data, index = index)

In [76]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [77]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [78]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [79]:
s = pd.Series(data)

In [80]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [81]:
s1 = s + 2

In [82]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [83]:
s2 = s + s1

In [84]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [85]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

In [86]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [87]:
pd1 = pd.DataFrame(data)

In [88]:
index = ['Linha' + str(i) for i in range(3)]

In [89]:
index

['Linha0', 'Linha1', 'Linha2']

In [90]:
df1 = pd.DataFrame(data, index)

In [91]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [92]:
columns = ['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [93]:
df1 = pd.DataFrame(data, index, columns)

In [94]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [95]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [96]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [97]:
df2 = pd.DataFrame(data)

In [98]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [99]:
data = [(1, 2, 3),
        (4, 5, 6),
        (7, 8, 9)]

In [100]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [101]:
df3 = pd.DataFrame(data, index, columns)

In [102]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [103]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [104]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [105]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [106]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [107]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

   A  B  C
X  1  2  3
Y  4  5  6